{
    "name": "Ma Jianglong",
    "address": "宁波市鄞州区宜园路宜家花园9幢10单元2008",
    "mobile": "(+86)186-5848-3609",
    "email": "06rjgcmjl@gmail.com",
    "educationTitle": "EDUCATION BACKGROUND",
    "educations": [{
        "period": "2010.9 - 2012.7",
        "school": "浙江大学",
        "degree": "Master",
        "major": "Software Engineering"
    }, {
        "period": "2006.9 - 2010.7",
        "school": "浙江大学",
        "degree": "Bachelar",
        "major": "Software Engineering"
    }],
    "careerTitle": "WORK EXPERIENCE",
    "careers": [{
        "period": "2016.9 - Now",
        "company": "NetEase",
        "title": "Senior Front-End Developer",
        "duty": "Develop web appliction in qiyu project under NetEase Hangzhou Research Institute."
    }, {
        "period": "2015.1 - 2016.8",
        "company": "Sumscope",
        "title": "Front-End Teamleader",
        "duty": "Conducting Front-End skills training, learning and promoting edge technologies, building Front-End frameworks and conventions, developing mobile web applications, and doing Front-End engineering etc."
    }, {
        "period": "2012.7 - 2015.1",
        "company": "IBM",
        "title": "Package Solution Consultant",
        "duty": "I almost worked as a Front-End consultant. Mainly doing js development based on Dojo and mobile hybrid web apps based on IBM Worklight."
    }],
    "projectTitle": "PROJECTS",
    "projects": [{
        "period": "2016.9 - Now",
        "company": "NetEase",
        "name": "Qiyu customer service system",
        "description": "Qiyu is a customer service system，which is to provide solution to the customer service area. I have accomplished several independent modules。Technically, We use NetEase standard NEJ and RequireJS as our framework，MVVM is heavily used."
    },{
        "period": "2016.5 - 2016.8",
        "company": "Sumscope",
        "name": "Unify Web Project",
        "description": "This project is aim to unify web ui which is sponsored and all done by myself. The final artifact is similar to Bootstrap, including a css theme and a few js plugins. I used LESS preprocessor and Gulp to build."
    }, {
        "period": "2015.1 - 2016.5",
        "company": "Sumscope",
        "name": "QB Projects",
        "description": "QB is a financial product of sumscope which is originally developed by C++. And latter modules are all developed as web application contained by CEF(Chromium Embedded Framework). QB likes stock software, but more than it. You can use it to view financial news, view analytics charts, manipulate financial data or even view realtime trends etc. The implementation is a bit complicated. There are many ui widgets like tree, charts, grid. Some modules even used SPA. We use Backbone and AngularJS as web framework and use websocket for realtime data pushing."
    }, {
        "period": "2014.6 - 2015.1",
        "company": "IBM",
        "name": "Worklight Consulting Projects",
        "description": "I have participated in several consulting projects based on IBM Worklight. IBM Worklight is a product to build mobile applications, especially hybrid web apps. IBM Worklight offers hybrid web app native shell, direct update, adapter to link to backend service and other essential features. So hybrid web app is almost web application, we use web techniques to develop mobile app. We use JQuery Mobile or Sench Touch as mobile web framework. After these projects, I am experienced in mobile web development."
    }, {
        "period": "2012.10 - 2014.5",
        "company": "IBM",
        "name": "Huawei Dojo Consulting Project",
        "description": "I am the only Dojo consultant dispatched to Huawei. Dojo is a great UI framework like ExtJS. My duty is to help build up front-end framework based on Dojo and solve tricky web problems. In order to meet Huawei's demand for deep customization, I learned the core mechanism and source code of Dojo. I learned Dojo's widget system and its lifecycle and many other advanced js topics such as AMD(Asynchronous Module Defination), js multiple inheritance, spa, url routing, i18n etc. This project has a profound impact on me. I growed a lot and became experienced rapidly."
    }],
    "skillTitle": "SKILLS",
    "skills": [
        "Understand HTML5，CSS3，Javascript deeply; Skilled in popular tools such as Jquery，Underscore，RequireJS; Familiar with UI frameworks like Dojo, ExtJs, EasyUI; Experienced in data visualization using Highcharts; Have lots of trials about SPA(Single Page Applciation) and modularization; Know well how to make a jquery plugin; Master Backbone and AngularJS, also learned other MVVM frameworks like Knockout, Vue, React; Engaged in mobile hybrid web app development, have quite time using jquery mobile and sench touch; Have used NodeJS, Gulp to build system.",
        "Know backend techniques. Have a good understanding of Java, JSP/Servelet. Familiar with data structure and algorithms.",
        "English: CET-6. Be able to conduct general oral communication. Have no trouble to read technical books in english."
    ],
    "assessmentTitle": "ASSESSMENT",
    "assessment": "I have a solid foundation of IT knowledge, have a deep understanding of web technologies, and am familiar with underlying principles. I also have strong learning and trouble-shooting capabilities. I am a perfectionist, always looking for the best solution. Finally, I have a good sense of style and a lot of creativity."
}
